addons-own/fso_con_zmr/soaprequest_templates/fo_donation_report_j2template.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:fil="https://finanzonline.bmf.gv.at/fon/ws/fileupload">
    <x:Header/>
    <x:Body>
        <fil:fileuploadRequest>

            <fil:tid>{{ submission['tid']|empty_if_exception_filter }}</fil:tid>
            <fil:benid>{{ submission['benid']|empty_if_exception_filter }}</fil:benid>
            <fil:id>{{ submission['id']|empty_if_exception_filter }}</fil:id>
            <fil:art>{{ submission['art']|empty_if_exception_filter or 'UEB_SA' }}</fil:art>
            <fil:uebermittlung>{{ submission['uebermittlung']|empty_if_exception_filter }}</fil:uebermittlung>

            <fil:data>
                <![CDATA[
                    <SonderausgabenUebermittlung xmlns="https://finanzonline.bmf.gv.at/fon/ws/uebermittlungSonderausgaben">

                        <Info_Daten>
                            <Fastnr_Fon_Tn>{{ submission['Fastnr_Fon_Tn']|empty_if_exception_filter }}</Fastnr_Fon_Tn>
                            <Fastnr_Org>{{ submission['Fastnr_Org']|empty_if_exception_filter }}</Fastnr_Org>
                        </Info_Daten>

                        <MessageSpec>
                            <MessageRefId>{{ submission['MessageRefId']|empty_if_exception_filter }}</MessageRefId>
                            <Timestamp>{{ submission['Timestamp']|empty_if_exception_filter }}</Timestamp>
                            <Uebermittlungsart>{{ submission['Uebermittlungsart']|empty_if_exception_filter }}</Uebermittlungsart>
                            <Zeitraum>{{ submission['Zeitraum']|empty_if_exception_filter }}</Zeitraum>
                        </MessageSpec>
                        {%- for report in donation_reports %}
                        {%- if report.get('sub_typ') == 'E' %}

                        <Sonderausgaben Uebermittlungs_Typ="E">
                            <RefNr>{{ report['RefNr']|empty_if_exception_filter }}</RefNr>
                            <Betrag>{{ report['Betrag']|empty_if_exception_filter }}</Betrag>
                            <vbPK>{{ report['vbPK']|empty_if_exception_filter }}</vbPK>
                        </Sonderausgaben>
                        {%- endif %}
                        {%- if report.get('sub_typ') == 'A' %}

                        <Sonderausgaben Uebermittlungs_Typ="A">
                            <RefNr>{{ report['RefNr']|empty_if_exception_filter }}</RefNr>
                            <Betrag>{{ report['Betrag']|empty_if_exception_filter }}</Betrag>
                        </Sonderausgaben>
                        {%- endif %}
                        {%- if report.get('sub_typ') == 'S' %}

                        <Sonderausgaben Uebermittlungs_Typ="S">
                            <RefNr>{{ report['RefNr']|empty_if_exception_filter }}</RefNr>
                        </Sonderausgaben>
                        {%- endif %}
                        {%- endfor %}

                    </SonderausgabenUebermittlung>
                ]]>
            </fil:data>
        </fil:fileuploadRequest>
    </x:Body>
</x:Envelope>
